{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4-tf",
  "convertedBy": "TensorFlow.js Converter v1.6.0",
  "modelTopology": {
    "keras_version": "2.2.4-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_9",
        "layers": [
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_9",
              "trainable": true,
              "batch_input_shape": [null, null],
              "dtype": "float32",
              "input_dim": 7018,
              "output_dim": 100,
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": null
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_9",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 128,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": { "gain": 1.0, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_9",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "binary_crossentropy",
      "metrics": ["acc"],
      "weighted_metrics": null,
      "sample_weight_mode": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "RMSprop",
        "config": {
          "name": "RMSprop",
          "learning_rate": 0.0010000000474974513,
          "decay": 0.0,
          "rho": 0.8999999761581421,
          "momentum": 0.0,
          "epsilon": 1e-7,
          "centered": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "dense_9/kernel", "shape": [128, 1], "dtype": "float32" },
        { "name": "dense_9/bias", "shape": [1], "dtype": "float32" },
        {
          "name": "embedding_9/embeddings",
          "shape": [7018, 100],
          "dtype": "float32"
        },
        { "name": "lstm_9/kernel", "shape": [100, 512], "dtype": "float32" },
        {
          "name": "lstm_9/recurrent_kernel",
          "shape": [128, 512],
          "dtype": "float32"
        },
        { "name": "lstm_9/bias", "shape": [512], "dtype": "float32" }
      ]
    }
  ]
}
